000100170923/***************************************************************/
000101170923/* LAB4                                                        */
000102170923/***************************************************************/
000103170925             CALL       STRJOB
000104170925             ADDLIBE    BCI433LIB
000105170925             MONMSG     MSGID(CF2013)
000106170925
000107170925
