000100170912/***************************************************************/
000200170912/* SYSVALPRG-display systems value                             */
000300170912/***************************************************************/
000400170912
000500170912PGM
000600170912    DSPLIBL
000700170912    EDTLIBL
000800170912    DSPLIBL
000900170912    DSPSYSVAL QSYSLIBL
001000170912    DSPSYSVAL QUSRLIBL
001100170912    DSPSYSVAL QMODEL
001200170912ENDPGM
